
/*Задача 19
Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. (можно решить через строку, а можно математически)
14212 -> нет
12821 -> да
23432 -> да
*/
/*
Console.WriteLine ("Введите 5-тизначное число");
string num = Console.ReadLine()!;
if (num.Length == 5)
{
    if (num[0]== num[4] && num[1] == num[3])
    {
        Console.WriteLine ("Это число является полиндромом");
    }
    else
    {
        Console.WriteLine ("Это число  не является полиндромом");
    }
}
else 
{
    Console.WriteLine ("Вы ввели неверное число");
}
*/
/*Задача 21
Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.
A (3,6,8); B (2,1,-7), -> 15.84
A (7,-5, 0); B (1,-1,9) -> 11.53


Задача 23
Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N.
3 -> 1, 8, 27
5 -> 1, 8, 27, 64, 125
*/


//Не успеваю понять, что происходит. Чувствую, что безнадежно отстаю от группы.
//Если есть что почитать, чтобы попытаться разобраться в вопросе, был бы признателен за ссылку.